apache/nuttx/arch/arm/src/stm32/stm32_1wire.c
#ifdef CONFIG_STM32_USART2_1WIREDRIVER

static const struct stm32_1wire_config_s stm32_1wire2_config =
{
  .usartbase  = STM32_USART2_BASE,
  .apbclock   = STM32_PCLK1_FREQUENCY,
  .data_pin   = PIN_OPENDRAIN(GPIO_USART2_TX),
  .irq        = STM32_IRQ_USART2,
};

static struct stm32_1wire_priv_s stm32_1wire2_priv =
{
  .config   = &stm32_1wire2_config,
  .refs     = 0,
  .lock     = NXMUTEX_INITIALIZER,
  .sem_isr  = SEM_INITIALIZER(0),
  .msgs     = NULL
};

#endif

#ifdef CONFIG_STM32_USART3_1WIREDRIVER

static const struct stm32_1wire_config_s stm32_1wire3_config =
{
  .usartbase  = STM32_USART3_BASE,
  .apbclock   = STM32_PCLK1_FREQUENCY,
  .data_pin   = PIN_OPENDRAIN(GPIO_USART3_TX),
  .irq        = STM32_IRQ_USART3,
};

static struct stm32_1wire_priv_s stm32_1wire3_priv =
{
  .config   = &stm32_1wire3_config,
  .refs     = 0,
  .lock     = NXMUTEX_INITIALIZER,
  .sem_isr  = SEM_INITIALIZER(0),
  .msgs     = NULL
};

#endif

#ifdef CONFIG_STM32_UART4_1WIREDRIVER

static const struct stm32_1wire_config_s stm32_1wire4_config =
{
  .usartbase  = STM32_UART4_BASE,
  .apbclock   = STM32_PCLK1_FREQUENCY,
  .data_pin   = PIN_OPENDRAIN(GPIO_UART4_TX),
  .irq        = STM32_IRQ_UART4,
};

static struct stm32_1wire_priv_s stm32_1wire4_priv =
{
  .config   = &stm32_1wire4_config,
  .refs     = 0,
  .lock     = NXMUTEX_INITIALIZER,
  .sem_isr  = SEM_INITIALIZER(0),
  .msgs     = NULL
};

#endif

#ifdef CONFIG_STM32_UART5_1WIREDRIVER

static const struct stm32_1wire_config_s stm32_1wire5_config =
{
  .usartbase  = STM32_UART5_BASE,
  .apbclock   = STM32_PCLK1_FREQUENCY,
  .data_pin   = PIN_OPENDRAIN(GPIO_UART5_TX),
  .irq        = STM32_IRQ_UART5,
};

static struct stm32_1wire_priv_s stm32_1wire5_priv =
{
  .config   = &stm32_1wire5_config,
  .refs     = 0,
  .lock     = NXMUTEX_INITIALIZER,
  .sem_isr  = SEM_INITIALIZER(0),
  .msgs     = NULL
};

#endif

#ifdef CONFIG_STM32_USART6_1WIREDRIVER

static const struct stm32_1wire_config_s stm32_1wire6_config =
{
  .usartbase  = STM32_USART6_BASE,
  .apbclock   = STM32_PCLK2_FREQUENCY,
  .data_pin   = PIN_OPENDRAIN(GPIO_USART6_TX),
  .irq        = STM32_IRQ_USART6,
};

static struct stm32_1wire_priv_s stm32_1wire6_priv =
{
  .config   = &stm32_1wire6_config,
  .refs     = 0,
  .lock     = NXMUTEX_INITIALIZER,
  .sem_isr  = SEM_INITIALIZER(0),
  .msgs     = NULL
};

#endif

#ifdef CONFIG_STM32_UART7_1WIREDRIVER

static const struct stm32_1wire_config_s stm32_1wire7_config =
{
  .usartbase  = STM32_UART7_BASE,
  .apbclock   = STM32_PCLK1_FREQUENCY,
  .data_pin   = PIN_OPENDRAIN(GPIO_UART7_TX),
  .irq        = STM32_IRQ_UART7,
};

static struct stm32_1wire_priv_s stm32_1wire7_priv =
{
  .config   = &stm32_1wire7_config,
  .refs     = 0,
  .lock     = NXMUTEX_INITIALIZER,
  .sem_isr  = SEM_INITIALIZER(0),
  .msgs     = NULL
};

#endif

#ifdef CONFIG_STM32_UART8_1WIREDRIVER

static const struct stm32_1wire_config_s stm32_1wire8_config =
{
  .usartbase  = STM32_UART8_BASE,
  .apbclock   = STM32_PCLK1_FREQUENCY,
  .data_pin   = PIN_OPENDRAIN(GPIO_UART8_TX),
  .irq        = STM32_IRQ_UART8,
};

static struct stm32_1wire_priv_s stm32_1wire8_priv =
{
  .config   = &stm32_1wire8_config,
  .refs     = 0,
  .lock     = NXMUTEX_INITIALIZER,
  .sem_isr  = SEM_INITIALIZER(0),
  .msgs     = NULL
};

#endif

/* Device Structures, Instantiation */

static const struct onewire_ops_s stm32_1wire_ops =
{
  .reset    = stm32_1wire_reset,
  .write    = stm32_1wire_write,
  .read     = stm32_1wire_read,
  .exchange = stm32_1wire_exchange,
  .writebit = stm32_1wire_writebit,
  .readbit  = stm32_1wire_readbit
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_1wire_in
 ****************************************************************************/

static inline uint32_t stm32_1wire_in(struct stm32_1wire_priv_s *priv,
                                      int offset)
{
  return getreg32(priv->config->usartbase + offset);
}

/****************************************************************************
 * Name: stm32_1wire_out
 ****************************************************************************/

static inline void stm32_1wire_out(struct stm32_1wire_priv_s *priv,
                                   int offset, uint32_t value)
{
  putreg32(value, priv->config->usartbase + offset);
}

/****************************************************************************
 * Name: stm32_1wire_recv
 *
 * Description:
 *   This method will recv one byte on the USART
 *
 ****************************************************************************/

static int stm32_1wire_recv(struct stm32_1wire_priv_s *priv)
{
  return stm32_1wire_in(priv, STM32_USART_RDR_OFFSET) & 0xff;
}

/****************************************************************************
 * Name: stm32_1wire_send
 *
 * Description:
 *   This method will send one byte on the USART
 *
 ****************************************************************************/

static void stm32_1wire_send(struct stm32_1wire_priv_s *priv, int ch)
{
  stm32_1wire_out(priv, STM32_USART_TDR_OFFSET, (uint32_t)(ch & 0xff));
}

/****************************************************************************
 * Name: stm32_1wire_set_baud
 *
 * Description:
 *   Set the serial line baud.
 *
 ****************************************************************************/

static void stm32_1wire_set_baud(struct stm32_1wire_priv_s *priv)
{
#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F37XX)
  /* This first implementation is for U[S]ARTs that support oversampling
   * by 8 in additional to the standard oversampling by 16.
   */

  uint32_t usartdiv8;
  uint32_t cr1;
  uint32_t brr;

  /* In case of oversampling by 8, the equation is:
   *
   *   baud      = 2 * fCK / usartdiv8
   *   usartdiv8 = 2 * fCK / baud
   */

  usartdiv8 = ((priv->config->apbclock << 1) + (priv->baud >> 1)) /
                priv->baud;

  /* Baud rate for standard USART (SPI mode included):
   *
   * In case of oversampling by 16, the equation is:
   *   baud       = fCK / usartdiv16
   *   usartdiv16 = fCK / baud
   *              = 2 * usartdiv8
   */

  /* Use oversamply by 8 only if the divisor is small.  But what is small? */

  cr1 = stm32_1wire_in(priv, STM32_USART_CR1_OFFSET);
  if (usartdiv8 > 100)
    {
      /* Use usartdiv16 */

      brr  = (usartdiv8 + 1) >> 1;

      /* Clear oversampling by 8 to enable oversampling by 16 */

      cr1 &= ~USART_CR1_OVER8;
    }
  else
    {
      DEBUGASSERT(usartdiv8 >= 8);

      /* Perform mysterious operations on bits 0-3 */

      brr  = ((usartdiv8 & 0xfff0) | ((usartdiv8 & 0x000f) >> 1));

      /* Set oversampling by 8 */

      cr1 |= USART_CR1_OVER8;
    }

  stm32_1wire_out(priv, STM32_USART_CR1_OFFSET, cr1);
  stm32_1wire_out(priv, STM32_USART_BRR_OFFSET, brr);

#else

  /* This second implementation is for U[S]ARTs that support fractional
   * dividers.
   */

  uint32_t usartdiv32;
  uint32_t mantissa;
  uint32_t fraction;
  uint32_t brr;

